; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph1 - mode
	thermograph0 - mode
	Star4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star1 - direction
	Star0 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star5 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet12)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation7)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation7)
	(calibration_target instrument7 Star5)
	(supports instrument8 thermograph1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star5)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
)
(:goal (and
	(pointing satellite1 Planet12)
	(pointing satellite2 Star10)
	(pointing satellite3 Star5)
	(have_image Star8 thermograph1)
	(have_image Planet9 thermograph1)
	(have_image Star10 thermograph0)
	(have_image Planet11 thermograph1)
	(have_image Planet12 thermograph1)
	(have_image Star13 thermograph0)
))

)

; plan
1. (turn_to satellite3 star5 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star5)
   goals met: 1 of 9
2. (turn_to satellite2 star10 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star10)
   goals met: 2 of 9
3. (turn_to satellite1 planet12 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet12)
   goals met: 3 of 9
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 9
5. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 3 of 9
6. (turn_to satellite0 planet12 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet12)
   goals met: 3 of 9
7. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 4 of 9
8. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 4 of 9
9. (take_image satellite0 planet11 instrument0 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 5 of 9
10. (turn_to satellite0 planet9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet9)
   goals met: 5 of 9
11. (take_image satellite0 planet9 instrument0 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 6 of 9
12. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 6 of 9
13. (take_image satellite0 star10 instrument0 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 7 of 9
14. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 7 of 9
15. (take_image satellite0 star13 instrument0 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 8 of 9
16. (turn_to satellite0 star8 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star8)
   goals met: 8 of 9
17. (take_image satellite0 star8 instrument0 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 9 of 9
